Revit 2027 API
BuiltInFailures.AnalyticalModelFailures.ProjectionPlanesParallel Property
 Can't project Analytical Model. Two or more projection planes are parallel.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ProjectionPlanesParallel { get; }
Public Shared ReadOnly Property ProjectionPlanesParallel As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ProjectionPlanesParallel {
	FailureDefinitionId^ get ();
}
static member ProjectionPlanesParallel : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.AnalyticalModelFailures Class
Autodesk.Revit.DB Namespace